---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayoutnodeCurvetypeParam
source: html/f9f842bd-26a4-ea46-2e98-02fc3d8b9309.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayoutnodeCurvetypeParam Property

"Curve Type Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId LayoutnodeCurvetypeParam { get; }
```